{"test_cases_lookup_map": {"{\"actual_output\": \"The SNP's policy on climate change involves a commitment to tackling climate change and nature loss, believing that emissions reduction and economic prosperity are interconnected. They aim to share in the economic opportunities of the global transition to net zero and demand fair funding from the UK Government to support Scotland's climate ambitions. Additionally, they advocate for the establishment of a Four Nations Climate Response Group to coordinate climate plans across the UK and ensure the UK Government maintains its climate ambition without backtracking.\", \"context\": null, \"expected_output\": \"Achieving net zero emissions by 2045, Reducing emissions by 75% by 2030. They emphasize Scotland's role as a global leader in tackling climate change.\", \"hyperparameters\": null, \"input\": \"What is the snp's policy on climate change?\", \"retrieval_context\": [\"20BUILDING A FAIRER, GREENER ECONOMY Under the SNP, Scotland\\u2019s economy is already one of the best performing parts of the UK with both GDP per head and productivity growing faster in Scotland than the UK as a whole.  But we want to go further. Our commitment to tackling the twin crises of climate change and nature loss is unwavering and we believe emissions reduction and economic prosperity go hand in hand. We want  to share in the enormous economic opportunities of the global transition to net zero. SNP MPs will demand the UK Government:\\nBring forward an immediate emergency budget following the election to reverse cuts to public spending and deliver meaningful investment in economic growth, including green energy.\", \"Scotland has over two thirds of the UK\\u2019s peatland, and currently plants over 60% of trees in the UK, yet funds restoration and planting within our budget, with no help from the UK Government. Westminster must ensure fair funding flows to devolved nations to enable our, and their, climate ambition given that for the whole of the UK to reach net zero by 2050, Scotland must do so  by 2045.\\nEstablish a Four Nations Climate Response Group to agree climate plans across the UK  that deliver on our net-zero targets and ensure  the UK Government stops backtracking on climate ambition.\"]}": {"cached_metrics_data": [{"metric_data": {"name": "Correctness (GEval)", "threshold": 0.5, "success": false, "score": 0.22760030266648318, "reason": "The actual output mentions tackling climate change and net zero but lacks specific targets like 2045 net zero and 75% by 2030 mentioned in the expected output.", "strictMode": false, "evaluationModel": "gpt-4o", "evaluationCost": 0, "verboseLogs": "Criteria:\nNone \n \nEvaluation Steps:\n[\n    \"Determine whether the actual output is factually correct based on the expected output.\"\n]"}, "metric_configuration": {"threshold": 0.5, "evaluation_model": "gpt-4o", "strict_mode": false, "include_reason": false, "evaluation_steps": ["Determine whether the actual output is factually correct based on the expected output."], "evaluation_params": ["expected_output", "actual_output"]}}, {"metric_data": {"name": "Faithfulness", "threshold": 0.7, "success": true, "score": 0.8333333333333334, "strictMode": false, "evaluationModel": "gpt-4o", "evaluationCost": 0, "verboseLogs": "Truths:\n[\n    \"Scotland’s economy is already one of the best performing parts of the UK with both GDP per head and productivity growing faster in Scotland than the UK as a whole.\",\n    \"Scotland has over two thirds of the UK’s peatland.\",\n    \"Scotland currently plants over 60% of trees in the UK.\",\n    \"Scotland funds restoration and planting within its budget, with no help from the UK Government.\",\n    \"For the whole of the UK to reach net zero by 2050, Scotland must do so by 2045.\"\n] \n \nClaims:\n[\n    \"The SNP's policy on climate change involves a commitment to tackling climate change and nature loss.\",\n    \"The SNP believes that emissions reduction and economic prosperity are interconnected.\",\n    \"The SNP aims to share in the economic opportunities of the global transition to net zero.\",\n    \"The SNP demands fair funding from the UK Government to support Scotland's climate ambitions.\",\n    \"The SNP advocates for the establishment of a Four Nations Climate Response Group to coordinate climate plans across the UK.\",\n    \"The SNP wants to ensure the UK Government maintains its climate ambition without backtracking.\"\n] \n \nVerdicts:\n[\n    {\n        \"verdict\": \"idk\",\n        \"reason\": null\n    },\n    {\n        \"verdict\": \"idk\",\n        \"reason\": null\n    },\n    {\n        \"verdict\": \"idk\",\n        \"reason\": null\n    },\n    {\n        \"verdict\": \"no\",\n        \"reason\": \"The actual output claims that the SNP demands fair funding from the UK Government to support Scotland's climate ambitions. However, the retrieval context states that Scotland funds restoration and planting within its budget, with no help from the UK Government.\"\n    },\n    {\n        \"verdict\": \"idk\",\n        \"reason\": null\n    },\n    {\n        \"verdict\": \"idk\",\n        \"reason\": null\n    }\n]"}, "metric_configuration": {"threshold": 0.7, "evaluation_model": "gpt-4o", "strict_mode": false, "include_reason": false}}, {"metric_data": {"name": "Contextual Relevancy", "threshold": 1.0, "success": false, "score": 0.5, "reason": "The score is 0.50 because the context discusses Scotland's peatland and related climate actions, but it does not directly address the SNP's policy on climate change.", "strictMode": false, "evaluationModel": "gpt-4o", "evaluationCost": 0, "verboseLogs": "Verdicts:\n[\n    {\n        \"verdict\": \"yes\",\n        \"reason\": null\n    },\n    {\n        \"verdict\": \"no\",\n        \"reason\": \"The context discusses Scotland's peatland, tree planting, and the need for fair funding and collaboration on climate plans, but it does not directly address the SNP's policy on climate change.\"\n    }\n]"}, "metric_configuration": {"threshold": 1.0, "evaluation_model": "gpt-4o", "strict_mode": false, "include_reason": true}}]}}}